In [1]:
%defaultDatasource jdbc:h2:mem:db1
%datasources chemistry=jdbc:h2:mem:chemistry

In [2]:
drop table if exists color;
CREATE TABLE color (
  id int(11) NOT NULL,
  name varchar(45) NOT NULL,
  code varchar(10),
  PRIMARY KEY (id)
);

INSERT INTO color (id, name, code) VALUES (1001,'AliceBlue','#F0F8FF');
INSERT INTO color (id, name, code) VALUES (1002,'AntiqueWhite','#FAEBD7');
INSERT INTO color (id, name, code) VALUES (1003,'Aqua','#00FFFF');
INSERT INTO color (id, name, code) VALUES (1004,'Aquamarine','#7FFFD4');
INSERT INTO color (id, name, code) VALUES (1005,'Azure','#F0FFFF');
INSERT INTO color (id, name, code) VALUES (1006,'Beige','#F5F5DC');
INSERT INTO color (id, name, code) VALUES (1007,'Bisque','#FFE4C4');
INSERT INTO color (id, name, code) VALUES (1008,'Black','#000000');

In [ ]:
SELECT * FROM color WHERE name LIKE 'A%';

In [ ]:
SELECT * FROM color WHE

In [ ]:
SELECT id FROM color;

In [10]:
%defaultDatasource jdbc:mysql:://mem:db1
%datasources chemistry=jdbc:h2:mem:chemistry

org.h2.jdbc.JdbcSQLException:  Table "COLOR" already exists; SQL statement